lkolbly/cmsis-svd/data/TexasInstruments/LM3S3739.svd
        <register>
          <name>EPC</name>
          <description>USB External Power Control</description>
          <addressOffset>0x00000400</addressOffset>
          <fields>
            <field>
              <name>USB_EPC_EPEN</name>
              <description>External Power Supply Enable Configuration</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_LOW</name>
                  <description>Power Enable Active Low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_HIGH</name>
                  <description>Power Enable Active High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_EPC_EPENDE</name>
              <description>EPEN Drive Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTEN</name>
              <description>Power Fault Input Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTSEN_HIGH</name>
              <description>Power Fault Sense</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTAEN</name>
              <description>Power Fault Action Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTACT</name>
              <description>Power Fault Action</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_UNCHG</name>
                  <description>Unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_TRIS</name>
                  <description>Tristate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_LOW</name>
                  <description>Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_HIGH</name>
                  <description>High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCRIS</name>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000404</addressOffset>
          <fields>
            <field>
              <name>USB_EPCRIS_PF</name>
              <description>USB Power Fault Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCIM</name>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000408</addressOffset>
          <fields>
            <field>
              <name>USB_EPCIM_PF</name>
              <description>USB Power Fault Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCISC</name>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x0000040C</addressOffset>
          <fields>
            <field>
              <name>USB_EPCISC_PF</name>
              <description>USB Power Fault Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRRIS</name>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>USB_DRRIS_RESUME</name>
              <description>RESUME Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIM</name>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>USB_DRIM_RESUME</name>
              <description>RESUME Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRISC</name>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000418</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_DRISC_RESUME</name>
              <description>RESUME Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPCS</name>
          <description>USB General-Purpose Control and Status</description>
          <addressOffset>0x0000041C</addressOffset>
          <fields>
            <field>
              <name>USB_GPCS_DEVMOD</name>
              <description>Device Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO_PORTA">
      <name>GPIO_PORTA_AHB</name>
      <prependToName>GPIO_PORTA_AHB</prependToName>
      <baseAddress>0x40058000</baseAddress>
    </peripheral>
